{
    "title": "About Us",
    "color" : "#FFA69E",
    "logo" : "about_us_logo.png",
    "content": [
        "เว็บไซต์นี้พวกเราสร้างขึ้น \"เพื่อให้ผู้ที่อยากจะเริ่มต้นเขียนโปรแกรมพื้นฐานหรือผู้ที่เคยเขียนโปรแกรมภาษาอื่นมาแล้วสนใจอยากเขียนหรือศึกษาเกี่ยวกับภาษาไพทอน สามารถเข้ามาศึกษาเว็บไซต์เพื่อเริ่มต้นได้ โดยพวกเราเลือกภาษาไพทอน เพราะว่าเป็น High-Level Programming Language และเป็นมิตรกับคนเขียนเพราะไวยากรณ์ไม่ซับซ้อน และเข้าใจง่าย รวมถึงปัจจุบันภาษาไพทอนเป็นที่นิยมมาก ทําให้มีกลุ่มคนผู้ใช้งานจํานวนมากที่พร้อมให้ความช่วยเหลือและตอบคําถามเมื่อมีปัญหา\"",
        "โดยเว็บไซต์นี้เป็นส่วนหนึ่งของวิชา Web Technology IT KMITL 2019",
        "<b>เทคโนโลยีที่พวกเราเลือกใช้</b>",
        "<ul>",
        "<li>HTML (Hypertext Markup Language) ใช้สําหรับการสร้างเว็บไซต์</li>",
        "<li>CSS (Cascading Style Sheets) และ Bootstrap (CSS Framework) ใช้สําหรับตกแต่งเว็บไซต์ให้สวยงาม</li>",
        "<li>JSON (JavaScript Object Notation) ใช้ในการเก็บข้อมูลเนื้อหาต่างๆบนเว็บไซต์ทั้งหมด</li>",
        "<li>JS (JavaScript) ใช้ในการดึงข้อมูลไฟล์ JSON มาแสดงผลบนเว็บไซต์</li>",
        "</ul>",
        "สามารถดูโค้ดของเว็บไซต์นี้ได้ที่ <a href='https://github.com/peetck/Basic-Python'>Github</a>",
        "<b>ทีมของพวกเรา</b>",
        "<ul>",
        "<li>นายวรภัทร ภัทรเมธาวรกุล 61070199 </li>",
        "<li>นายวิศรุต พันธุ์ไม้ศรี 61070211 </li>",
        "<li>นายศรัณย์ ยันตะบุษย์ 61070218 </li>",
        "<li>นายศิรวิทย์ ยอดจิตร 61070221 </li>",
        "</ul>",
        "<b>แหล่งอ้างอิง</b>",
        "เนื้อหาส่วนมากของเว็บไซต์กลุ่มของพวกเรารวบรวมกันเองและได้ใช้เนื้อหาบางส่วนจากเว็บไซต์",
        "<ul>",
        "<li><a href=\"https://www.w3schools.com\">W3schools</a></li>",
        "<li><a href=\"https://www.programiz.com\">Programiz</a></li>",
        "<li><a href=\"https://www.howtoautomate.in.th/python-comprehension-generator\">HowToAutomate</a></li>",
        "</ul>",
        "ในส่วนของไอค่อนต่างๆจากเว็บไซต์ของพวกเรามาจากเว็บไซต์ : <a href=\"https://www.flaticon.com\">Flaticon</a>",
        "ในส่วนของโค้ดพวกเราได้คิดตัวอย่างของโค้ดและนำไปสร้างเป็นรูปภาพในเว็บไซต์ : <a href=\"https://carbon.now.sh/\">Carbon</a>"
    ]
}