{
    "title": "History",
    "color" : "#84DCC6",
    "logo" : "history_logo.png",
    "content" : [
        "ภาษา Python มีการพัฒนามาอย่างยาวนานมากกว่า 20 ปีครับ โดยเรียงลำดับประวัติความเป็นมาของ Python ได้ดังนี้เลย",
        "<b>1989 จุดเริ่มต้นความคิดในการสร้างภาษา Python</b>",
        "ภาษา Python ถูกสร้างขึ้นในต้นยุค 90 โดย Guido van Rossum ที่ Stichting Mathematisch Centrum (CWI) ในประเทศเนเธอร์แลนด์ครับ โดยต้นแบบภาษาสืบทอดมาจากภาษา ABC นั้นเอง",
        "โดยภาษา ABC เป็นภาษาที่ถูกออกแบบให้ง่ายต่อการเรียนรู้ ซึ่ง Van Rossum เคยช่วยเหลือในการพัฒนาภาษา ABC มาในก่อนหน้านี้ครับแต่ Van Rossum ได้มองเห็นปัญหาของภาษา ABC แต่เขาก็ยังคงชอบลักษณะเด่น ๆ จำนวนมากของภาษา ABC อยู่ เขาจึงสร้างภาษาสคริปต์ (scripting language) ใหม่ที่ใช้ไวยากรณ์ของ ABC ที่ได้แก้ไขปัญหาที่เขาพบบางอย่างลงไปครับ เช่น สนับสนุนการจัดการกับข้อผิดพลาด (Exception Handling) เป็นต้น",
        "ซึ่ง Van Rossum เริ่มต้นพัฒนาภาษาใหม่ในช่วงวันหยุดคริสต์มาสเดือนธันวาคม ค.ศ.1989 ครับแต่ช่วงนั้นเขายังไม่ได้ตั้งชื่อภาษาใหม่นี้ จนกระทั่ง เขาได้อ่านอ่านสคริปต์ที่ตีพิมพ์จากซีรีส์ตลก \"Monty Python’s Flying Circus\" ของบีบีซี ซีรีส์ตลกจากช่วงยุค 1970 เขาจึงเลือกชื่อ \"Python\" จึงกลายเป็นจุดเริ่มต้นของภาษา Python มาจนถึงทุกวันนี้ครับ",
        "<b>1990 Python ถูกเผยแพร่ภายใน CWI</b>",
        "<b>1991 Python เวอร์ชั่นแรกที่ออกสู่สายตาชาวโลก</b>",
        "20 กุมภาพันธ์ ค.ศ.1991 Python 0.9.0 ได้ออกมาสู่สายตาชาวโลกครั้งแรกครับ โดยถูกเผยแพร่บน USENET (สามารถโหลดโค้ด Python 0.9.1 ได้ <a href='https://www.python.org/download/releases/early/'>ที่นี้</a>) โดยมาพร้อมกับ classes พร้อมด้วย inheritance, การจัดการกับข้อผิดพลาด (Exception Handling) , ฟังก์ชัน (functions), และชนิดข้อมูลหลัก อย่างเช่น list, dict, str และอื่น ๆ เป็นต้นโดยทั้งหมดเป็นระบบโมดูลที่ยืมมาจาก Modula-3 ครับ",
        "<b>1994 Python 1.0</b>",
        "26 มกราคม ค.ศ.1994 Python 1.0 ได้ถูกปล่อยออกมาครับ พร้อมกับเครื่องมือสำหรับ functional programming เช่น lambda,  map, filter และ reduce เป็นต้น",
        "<b>1995 van Rossum ย้ายไปทำงานที่ CNRI</b>",
        "<b>2000 ทีมนักพัฒนา Python ย้ายไป BeOpen.com </b>",
        "ทีมนักพัฒนา Python ย้ายจาก CNRI ไป BeOpen.com ครับและไปเป็นส่วนหนึ่งทีม PythonLabs แต่ทาง CNRI ได้ร้องขอ Python 1.6  ทีมนักพัฒนาจึงปล่อย Python 1.6 และ Python 2.0 โดยมีช่วงเวลาใกล้เคียงกัน",
        "หลังจากที่ปล่อย Python 2.0 ภายใต้ BeOpen.com แล้วทั้ง Van Rossum และ PythonLabs ได้ย้ายไปทำงานที่ Digital Creations ครับ(ปัจจุบันกลายเป็น Zope Corporation) จึงทำให้ Python 2.0  เป็นเวอร์ชั่นเดียวที่ออกภายใต้ BeOpen.com",
        "<b>2001 Python Software Foundation ถูกก่อตั้งขึ้นมา</b>",
        "Python Software Foundation หรือ PSF ถูกก่อตั้งขึ้นมาเป็นมูลนิธิเพื่อเป็นเจ้าของทรัพย์สินทางปัญญาที่เกี่ยวกับ Python ครับโดย Zope Corporation ได้เป็นผู้ร่วมสนับสนุน",
        "<b>2006 เริ่มต้นพัฒนา Python 3000</b>",
        "ค.ศ.2006 ทาง PSF ได้เริ่มต้นพัฒนา Python 3000 ครับซึ่งเข้ากันไม่ได้กับ Python 2.X เวอร์ชั่นที่ผ่านมา จึงเป็นการยกเครื่องครั้งใหญ่ของภาษา Python ครับ",
        "<b>2008 Python 3.0 ออกเวอร์ชั่นจริง</b>",
        "พร้อมกับ Python 2.6 ในเวลาใกล้เคียงกันครับ โดย Python 3.0 มาพร้อมความสามารถใหม่และสนับสนุน Unicode",
        "<b>2011 PEP404 - ไม่มี Python 2.8 </b>",
        "จาก PEP404 ทำให้ Python 2.7 กลายเป็นเวอร์ชั่่นสุดท้ายของ Python 2 ครับโดยหลังจากนี้ Python 2.7 จะได้รับการสนับสนุนด้านความปลอดภัยจนถึงปี ค.ศ.2020",
        "<b>2018 Guido van Rossum ออกจากตำแหน่งผู้นำ Python</b>",
        "12 กรกฎาคม 2018 Guido van Rossum ผู้ก่อตั้งภาษา Python และดำรงตำแหน่งผู้นำภาษา Python มาตั้งแต่ก่อตั้ง ได้ประกาศออกจากตำแหน่งผู้นำ Python หรือ \"Benevolent dictator for life\" (BDFL) ครับโดยสาเหตุมาจากการออกมาตรฐาน PEP 572"
    ]
}