{
    "title": "Installation",
    "color": "#FFA69E",
    "logo" : "installation_logo.png",
    "content" : [
        "ในการติดตั้งภาษา Python นั้นง่ายมากๆเลยครับวิธีการคือให้เราเข้าไปที่เว็บไซต์ <a href='https://www.python.org/'>python.org</a> ครับจากนั้นไปที่หน้า Download และเลือกเวอร์ชั่นและระบบปฏิบัติการที่ต้องการครับ (เนื้อหาในเว็บไซต์นี้จะเป็น Python 3.7.4)",
        "<img src='images/install.png' alt='can't load install.png' class='img-fluid mb-3'>",
        "ในขั้นตอนการติดตั้งนั้นให้เราติ้กช่องที่เขียนไว้ว่า 'Add Python 3.7 to PATH' ครับเพื่อที่จะทําให้เราสามารถเรียกใช้ Python ผ่านทาง CMD ของเราได้ครับจากนั้นก็กดที่ 'Install Now' ได้เลยครับ",
        "<img src='images/install_path.png' alt='can't load install_path.png' class='img-fluid mb-3'>",
        "หลังจากเราติดตั้งเรียบร้อยแล้วเราสามารถทดสอบได้ครับว่าเราได้ติดตั้ง Python แล้วหรือยังด้วยการเปิด CMD ครับแล้วพิมพ์คําว่า 'py --version' ครับ",
        "<img src='images/install_py.png' alt='can't load install_py' class='img-fluid mb-3'>",
        "จะเห็นว่าเราได้รับข้อความ 'Python 3.7.4' ซึ่งก็คือเราได้ติดตั้ง Python เรียบร้อยแล้วครับ",
        "<hr>",
        "<b>การใช้งานภาษา Python</b>",
        "ในการทํางานของภาษา Python นั้นจะมีหลักๆอยู่ 2 วิธีตามนี้เลยครับ",
        "<ul>",
        "<li>Interactive Mode คือการที่เราพิมพ์ Code ที่ต้องการจะรันในแต่ละบรรทัดและผลลัพธ์ก็จะออกมาตามแต่ละบรรทัดครับ</li>",
        "<li>Script Mode คือการที่เรามีไฟล์ Python (.py) ที่เป็นโค้ดแล้วนํามารันครับ</li>",
        "</ul>",
        "การใช้งาน Interactive Mode ง่ายๆเลยครับเราก็เปิด CMD หรือจะเข้าตัว IDLE ที่มีมาให้หลังจากติดตั้ง Python แล้วก็ได้ครับ",
        "<img src='images/python_idle.png' alt='' class='img-fluid mb-3'> <img src='images/python_cmd.png' alt='' class='img-fluid mb-3'>",
        "การใช้งาน Script Mode เราสามารถทําได้โดยการเปิด CMD ครับและไปที่ Directory ที่ไฟล์ของเราอยู่จากนั้นให้เราพิมพ์ 'py -3 <ชื่อไฟล์>.py' ครับจากนั้น Python ก็จะนําโค้ดที่อยู่ข้างในไฟล์นั้นมารันซึ่งหากเราใช้ IDLE ของ Python ก็สามารถรันได้โดยการกด F5 ครับ",
        "<img src='images/python_idle2.png' alt='' class='img-fluid mb-3'> <img src='images/python_cmd2.png' alt='' class='img-fluid mb-3'>",
        "<b>การใช้งาน CMD</b>",
        "จะมีคําสั่งคร่าวๆประมาณนี้ครับ",
        "<ul>",
        "<li>คําสั่ง dir จะแสดงไฟล์หรือโฟลเดอร์ที่อยู่ในตําแหน่งที่เราอยู่ครับ</li>",
        "<li>คําสั่ง cd จะเป็นการย้ายตําแหน่งเข้าไปในโฟลเดอร์หรือตําแหน่งที่เราต้องการครับ</li>",
        "<li>คําสั่ง cd.. จะเป็นการย้อนกลับไปโฟลเดอร์หรือตําแหน่งก่อนหน้าครับ</li>",
        "</ul>",
        "<img src='images/cmd1.png' alt='' width='500' class='img-fluid mb-3'> <img src='images/cmd2.png' alt='' class='img-fluid mb-3'>",
        "จากรูปคือผมมีไฟล์ที่ต้องการจะรันอยู่ที่ desktop ครับผมก็เลยใช้ cd ย้าย ไปที่ desktop แล้วจึงค่อยพิมพ์ใช้งาน Python ครับ"
    ]
}