{
    "title" : "Lambda Function",
    "color" : "#FFA69E",
    "logo" : "lambda_function_logo.png",
    "content" : [
        "Lambda Function จริงๆแล้วก็คือ Function ที่เป็น Anonymous function ครับซึ่งเป็นที่นิยมในการเขียน Functional Programming ครับ ถ้าให้พูดจริงๆแล้วเวลาเราเขียนโปรแกรมเราอาจจะไม่ใช้เลยก็ได้ครับ แต่การใช้ Lambda function จะช่วยลดความซํ้าซ้อนกันของ Code ครับ",
        "โดย Syntax ก็จะใช้คําสั่งที่ชื่อว่า lambda และตามด้วย arguments : expression ครับพูดแล้วอาจจะงง เรามาลองดูตัวอย่างกันครับ",
        "<img src='images/ex/ex213.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex214.png' alt='' class='img-fluid mb-3'>",
        "ซึ่งการใช้ lambda ปกติเราจะนิยมไปใช้คู่กับ 3 ตัวนี้ครับ ซึ่งก็คือ",
        "<ul>",
        "<li>Map</li>",
        "<li>Reduce</li>",
        "<li>Filter</li>",
        "</ul>",
        "<b>Map</b>",
        "โดย map() จะช่วยให้เราสามารถเขียนโค้ดสไตล์ Functional Programming ได้ครับโดยใช้คู่กับ lambda function ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex215.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex216.png' alt='' class='img-fluid mb-3'>",
        "ที่เราต้องครอบ list() อีกทีนึงเพราะหากเราไม่ได้ครอบมันจะเป็น Map Object ครับ",
        "โดยเจ้า arguments ของ lambda function ก็สามารถเป็น function ได้เหมือนกันครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex217.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex218.png' alt='' class='img-fluid mb-3'>",
        "ซึ่งถ้าเราสังเกตเนี่ยจริงๆแล้วการใช้ map ก็คล้ายๆกับการที่เราใช้ for loop นั้นแหละครับแต่ถามว่าทําไปทําไม?",
        "ข้อดีอีกอย่างของ map เนี่ยก็คือมันเร็วกว่า loop ครับซึ่งหมายความว่ามันให้ performance ที่ดีกว่าการใช้ loop ครับ",
        "<b>Reduce</b>",
        "หน้าที่ของมันก็คือมันจะรับ function กับ iterator(String, List, Tuple เป็นต้น) ครับแต่ผลลัพธ์มันจะออกมาเป็นแค่ 1 ค่าเท่านั้นครับ",
        "โดยใน Python 3.7.4 เราต้อง import functools ก่อนถึงจะใช้ reduce ได้ครับ",
        "ซึ่งมันจะทําการวนลดรูปจนประมวลผลเหลือแค่ค่าสุดท้ายครับ พูดแล้วอาจจะงงมาดูตัวอย่างกันครับ",
        "<img src='images/ex/ex219.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex220.png' alt='' class='img-fluid mb-3'>",
        "จาดโค้ดข้างบนคือมันจะทําการเทียบค่าแล้วเอาค่าที่ได้มาเทียบกับตัวถัดไปใน list แล้วทําต่อไปเรื่อยๆจนเหลือค่าเดียวครับ ซึ่งจากโค้ดนี้มันก็จะแสดงผลค่าที่มากที่สุดนั้นเอง",
        "หรือหากเราอยากได้ค่าของการบวกกันของตัวเลข 1 - 999 ก็สามารถเขียนได้ตามนี้เลยครับ",
        "<img src='images/ex/ex221.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex222.png' alt='' class='img-fluid mb-3'>",
        "<b>Filter</b>",
        "ง่ายๆคือเป็นการเอาสิ่งที่ไม่ต้องการเก็บไว้ออกไปครับให้เหลือแค่ที่เราต้องการครับ (ลบค่าที่ไม่ต้องการทิ้ง) ยกตัวอย่างเช่น",
        "<img src='images/ex/ex223.png' alt='' class='img-fluid mb-3'> <img src='images/ex/ex224.png' alt='' class='img-fluid mb-3'>",
        "จากโค้ดนี่คือผมให้มันเก็บค่าที่ >= 0 ไว้เท่านั้นครับ โดยที่เราต้องครอบ list() อีกทีนึงเพราะหากเราไม่ได้ครอบมันจะเป็น Filter Object ครับ",
        "สรุปแล้วการใช้ lambda function ร่วมกับ map reduce และ filter จะช่วยให้เราลดโค้ดที่เป็นขยะออกไปได้เยอะมากเลยครับ จริงๆแล้วเราสามารถใช้ประยุกต์ได้อีกเยอะเลยครับ"
    ]
}