{
    "title": "Loop",
    "color" : "#FFA69E",
    "logo" : "loop_logo.png",
    "content": [
        "<b>Loop คืออะไร?</b>",
        "Loop คือการทํางานซํ้าๆครับ ยกตัวอย่างเช่น เราต้องการปริ้นข้อความว่า Hello 100 ครั้งหากเราต้องมานั่งพิมพ์คําสั่ง print() จนครบก็คงจะลําบากครับ",
        "เราจึงนําสิ่งที่เรียกว่า Loop มาช่วยครับ โดยใน Python Loop จะมี 2 ประเภทครับ",
        "<ul><li>While loop</li><li>For loop</li></ul>",
        "<b>While loop</b>",
        "While loop คือการทํางานไปเรื่อยๆจนกว่าเงื่อนไขที่กําหนดไว้จะเป็นเท็จครับ",
        "นิยมใช้ตอนที่เราไม่รู้จํานวนรอบที่แน่นอนครับ",
        "โดยเงื่อนไขเนี่ยก็คือเรากําหนดเป็น Boolean expression ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex42.png' alt='' class='img-fluid mb-3'>",
        "จากโค้ดข้างบนนะครับ ตอนแรกเรามีการประกาศให้ count = 0 จากนั้นเราก็จะให้มันทําคําสั่ง แสดงค่า count และบวกค่าให้หนึ่งไปเรื่อยๆครับตราบใดที่ค่าของ count ไม่เท่ากับ 10 ครับ",
        "เรามาดูตัวอย่างเพิ่มเติมกันครับ",
        "<img src='images/ex/ex43.png' alt='' class='img-fluid mb-3'>",
        "<b>For loop</b>",
        "หลักการทำงานของ for คือ จะทำงานไปเรื่อยๆครับจนกว่าจะครบรอบตามที่เรากำหนดใน Build in function range() ครับหรือ ใช้กับ str, list, etc. ได้โดยจะมี Variable ที่เรากําหนดขึ้นมาให้เป็นตัวแปรในแต่ละรอบครับ",
        "นิยมใช้ตอนที่เรารู้รอบจัดเจนครับ",
        "<b>Built-in function range()</b>",
        "หน้าที่ของ range() คือจะทําการ return ลําดับตัวเลขออกมาครับโดยจะมี Arguments เป็น (start, stop, step) ครับ",
        "<ul><li>start จะเป็นการกําหนดเลขเริ่มต้นครับว่าจะให้เริ่มต้นที่เท่าใด</li><li>stop เป็นการกําหนดว่าจะให้หยุดที่เท่าใดครับ (n - 1)</li><li>step เป็นการกําหนดครับว่าในแต่ละรอบจะให้เพิ่มขึ้นหรือลดลงทีละเท่าใดครับ</li></ul>",
        "โดยหากเราเขียน range(stop) หมายความว่าเริ่มจาก 0 จบที่ค่าที่น้อยกว่า stop 1 ค่า แล้วเพิ่มทีละ 1 ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex44.png' alt='' class='img-fluid mb-3'>",
        "โดยหากเราเขียน range(start, stop) หมายความว่าเริ่มจาก start จบที่ค่าที่น้อยกว่า stop 1 ค่า แล้วเพิ่มทีละ 1 ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex45.png' alt='' class='img-fluid mb-3'>",
        "โดยหากเราเขียน range(start, stop, step) หมายความว่าเริ่มจาก start จบที่ค่าที่น้อยกว่า stop 1 ค่า แล้วเพิ่มทีละ step ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex46.png' alt='' class='img-fluid mb-3'>",
        "<img src='images/ex/ex47.png' alt='' class='img-fluid mb-3'>",
        "เราสามารถใช้ for loop กับ String ได้ครับ (โดยในแต่ละรอบจะเป็นการนำ String แต่ละตัวอักษรมาครับ) ยกตัวอย่างเช่น",
        "<img src='images/ex/ex48.png' alt='' class='img-fluid mb-3'>",
        "<b>ส่วนการใช้ for loop กับชนิดข้อมูลอื่นๆเช่น list, dic เราจะไปดูกันในหัวข้อของชนิดข้อมูลนั้นครับ</b>",
        "ต่อไปเรามาดูคําสั่งที่เกี่ยวกับการใช้ for loop กันครับ โดยจะมีด้วยกันอยู่ 2 อย่างครับตามนี้เลย",
        "<b>คำสั่ง break</b>",
        "จะเป็นการหยุดการทํางานของลูปนั้นโดยทันทีครับ โดยจะไม่สนใจโค้ดที่เหลืออยู่เลย",
        "<img src='images/ex/ex49.png' alt='' class='img-fluid mb-3'>",
        "<b>คำสั่ง continue</b>",
        "จะเป็นการบอกให้ไปทํารอบถัดไปทันทีครับ โดยจะไม่สนใจโค้ดที่เหลืออยู่เลย",
        "<img src='images/ex/ex50.png' alt='' class='img-fluid mb-3'>"
    ]
}