{
    "title": "Try & Except",
    "color" : "#A5FFD6",
    "logo" : "try_except_logo.png",
    "content" : [
        "จริงๆแล้วในการเขียนโปรแกรมคิดว่าหลายๆคนก็ต้องเจอกับสิ่งที่เรียกว่า Error ถูกไหมครับโดยในบทนี้เราจะมาเรียนรู้การจัดการกับ Error กันครับ",
        "โดย Error ในภาษา Python เราจะยกตัวอย่าง Error ที่พบเจอได้บ่อยครับมีคร่าวๆตามนี้เลย",
        "<ul>",
        "<li>SyntaxError : คือการที่เราเขียนผิด Syntax ของภาษาครับ ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex102.png' alt='' class='img-fluid mb-3'></li>",
        "<li>ZeroDivisionError : คือการที่เราหาร 0 ครับ ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex103.png' alt='' class='img-fluid mb-3'> </li>",
        "<li>NameError : คือการที่เราเรียกใช้ตัวแปรที่ยังไม่ได้ถูกประกาศครับ ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex104.png' alt='' class='img-fluid mb-3'></li>",
        "<li>TypeError : ส่วนมากจะเกิดเวลาที่เราทําการดําเนินการกับค่าโดยผิดประเภทครับ ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex105.png' alt='' class='img-fluid mb-3'></li>",
        "<li>ValueError : ส่วนมากจะเกิดเวลาเราทําการแปลงค่าครับ ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex106.png' alt='' class='img-fluid mb-3'></li>",
        "<li>IndexError : คือการที่เรา Index แล้วมันไม่มีครับ(Out of range) ยกตัวอย่างเช่น <br><br> <img src='images/ex/ex107.png' alt='' class='img-fluid mb-3'></li>",
        "</ul>",
        "โดยเราสามารถจัดการกับข้อผิดพลาดพวกนี้ได้โดยการใช้คําสั่งที่ชื่อว่า try และ except ครับ",
        "โดยเราสามารถนําโค้ดไปใส่ไว้ใน try และหากมีการ error เกิดขึ้นก็ใช้ except ดักจับครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex108.png' alt='' class='img-fluid mb-3'> ",
        "จากรูปคือหากมีการ error เกิดขึ้นในโค้ดที่อยู่ใน try โปรแกรมจะทําการกระโดดไปที่ except ทันทีครับแล้วจะไม่ทําบรรทัดที่เหลืออยู่ใน try เลย",
        "โดยหากเราเขียนแค่ except เนี่ยหมายความว่าให้ดักจับทุก error ครับซึ่งหากเราอยากที่จะดักทํา error ที่ต่างกันให้ทําโค้ดที่เราต้องการก็สามารถทําได้ครับโดยการใส่ except และตามด้วยชื่อชนิดของ Error ครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex109.png' alt='' class='img-fluid mb-3'> ",
        "หรือเราสามารถดักจับ error ที่แตกต่างกันให้แสดงผลเหมือนกันก็สามารถทําได้เหมือนกันครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex110.png' alt='' class='img-fluid mb-3'>",
        "เราสามารถเพิ่มคําสั่งที่ชื่อว่า finally ได้ครับซึ่งหน้าที่ของมันคือ 'ไม่ว่าใน try จะเกิด Error หรือไม่เกิดก็จะมาทํา finally ในตอนท้ายเสมอครับ' ยกตัวอย่างเช่น",
        "<img src='images/ex/ex111.png' alt='' class='img-fluid mb-3'>",
        "จริงๆแล้วยังมีอีกคําสั่งหนึ่งครับ ก็คือ raise ครับซึ่งหน้าที่ของมันก็คือทําให้เกิด Error ตามชนิดที่เราต้องการครับ ยกตัวอย่างเช่น",
        "<img src='images/ex/ex112.png' alt='' class='img-fluid mb-3'> "
    ]
}