{
    "title" : "Why Python",
    "color" : "#A5FFD6",
    "logo" : "why_python_logo.png",
    "content" : [
        "หลายๆคนอาจจะสงสัยครับว่าทําไมต้องเป็น Python ที่พวกเราเลือก Python นั้นก็เพราะว่า",
        "<b>เรียนรู้ง่าย</b>",
        "<ul>",
        "<li>คุณสมบัติที่โดดเด่นข้อแรกของ Python คือเป็นภาษาที่สามารถเรียนรู้ได้ง่ายครับเนื่องจากถูกออกแบบมาให้สามารถเขียนได้คล้ายๆกับภาษาอังกฤษธรรมดา ตัดเอา symbol บางอย่างที่ไม่จำเป็นออกไป และใช้การย่อหน้า (Indentation) เหมือนภาษาอังกฤษในการแบ่งแยกโปรแกรมออกเป็นส่วนๆ</li>",
        "<li>เนื่องจากความง่ายในการเรียนรู้นี้ทำให้ Python มักเป็นภาษาแรกๆที่โรงเรียนหรือมหาวิทยาลัย (แม้กระทั่งมหาวิทยาลัยชั้นนำของโลก) ใช้ในการสอนวิชาการเขียนโปรแกรมเบื้องต้นครับ โดยนักเรียนสามารถเรียนรู้ Logic ของการเขียนโปรแกรมได้อย่างรวดเร็วโดยไม่ต้องเสียเวลาจดจำรายละเอียดปลีกย่อยที่ไม่จำเป็น</li>",
        "</ul>",
        "<center><img src='images/why_python/why.png' width='500' alt='' class='img-fluid mb-3'></center>",
        "<b>มี Library ที่หลากหลายมาก</b>",
        "Python นับเป็นภาษาหนึ่งที่มี Library ให้ใช้งานได้หลากหลายมากมายอลังการอย่างไม่น่าเชื่อครับ ทั้งที่เป็นภาษาที่เป็น Opensource ซึ่งหมายถึงคนที่สามารถเขียนภาษา Python จะสามารถประยุกต์ใช้ความสามารถนี้ไปทำงานซอฟท์แวร์ในแขนงต่างๆ (โดยการเรียนรู้ Library เพิ่มเติมในเรื่องนั้นๆที่ถูกเขียนขึ้นมาด้วยภาษา Python) ได้อย่างแทบไม่มีขีดจำกัดครับ ยกตัวอย่างเช่น",
        "<ul>",
        "<li><b>System Admin :</b> Python ถือเป็นทางเลือกหรืออาจจะว่าเป็นคู่แข่งตัวฉกาจของภาษาตระกูล scripting language อื่นๆเช่น bash script หรือ ภาษา perl ครับนั่นหมายความว่าถ้าจะเขียนโปรแกรมเพื่อควบคุมการทำงานของ System (โดยเฉพาะ Linux) การเขียนภาษา Python ได้ทำให้ System Admin คนนั้นมีความได้เปรียบอย่างมาก</li>",
        "<center><img src='images/why_python/sysadmin.jpg' width='500' alt='' class='img-fluid mb-3'></center>",
        "<li><b>Web Application :</b> Python มี Framework ที่แข็งแกร่งหลายตัวครับ เช่นตัวที่เด่นสุดก็น่าจะเป็น Django ซึ่งได้รับการยกย่องว่าเป็น Web Application Framework ที่สามารถทุ่นเวลาการพัฒนาได้อย่างมากมายมหาศาล นั่นหมายถึงในโปรเจกต์เดียวกัน คนที่ใช้ Python/Django เขียนอาจจะสามารถเขียนได้ในเวลาที่รวดเร็วกว่า ต้นทุนต่ำกว่า ความผิดพลาดน้อยกว่า และมีความยืดหยุ่นกว่าสำหรับการเพิ่มเติมฟังก์ชั่นในอนาคตครับ</li>",
        "<center><img src='images/why_python/webapp.jpg' width='500' alt='' class='img-fluid mb-3'></center>",
        "<li><b>Data Analytics & Machine Learning :</b>  ด้วยความที่ Python ถูกประยุกต์ใช้งานทางด้านวิทยาศาสตร์อย่างมากตั้งแต่แรกเริ่มครับ จึงทำให้ Python มี​ Library ที่เกี่ยวข้องกับการคำนวณทางคณิตศาสตร์ชั้นสูงมากมายซึ่งรวมถึง สถิติ, อัลกอริธึม, Machine Learning, Artificial Intelligence ถ้าพูดถึงในเรื่องของ Data Science แล้วน่าจะมีคู่ท้าชิงในแง่ของภาษาคอมพิวเตอร์เด่นๆอยู่สองภาษานั่นคือ ภาษา Python และ ภาษา R ครับซึ่งนั่นหมายถึง Python ก็เท่ากับได้อานิสงส์ในแง่ของความสามารถในด้าน Data Science เข้าไปด้วยโดยปริยาย (เมื่อได้เรียนรู้ Library เพิ่มเติม)</li>",
        "<center><img src='images/why_python/data.jpg' width='500' alt='' class='img-fluid mb-3'></center>",
        "</ul>",
        "<b>มาแรง</b>",
        "<ul>",
        "<li>ปัจจุบัน Python เป็นที่นิยมมากครับ ทําให้มีกลุ่มคนผู้ใช้งานจํานวนมากที่พร้อมให้ความช่วยเหลือและตอบคําถามเมื่อมีปัญหา และสําหรับประเทศไทยมีสถานอุดมศึกษาหลายแห่งได้บรรจุภาษา Python เป็นวิชาหลักสูตรด้านการเขียนโปรแกรมคอมพิวเตอร์แล้ว</li>",
        "<li>เป็นที่ต้องการของตลาดครับ เงินเดือนเฉลี่ยของ Python Developer ที่ประเทศอเมริกาสูงถึง 119,593 เหรียญต่อปี (2018)</li>",
        "<center><img src='images/why_python/salary.png' width='500' alt='' class='img-fluid mb-3'></center>",
        "</ul>"
    ]
}